# NoSpaceBoundingElementsWarn Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EnergyAnalysisFailures..::..NoSpaceBoundingElementsWarn Property
BuiltInFailures..::..EnergyAnalysisFailures Class See Also
---
Can't create any energy analysis surfaces. There are no Space bounding elements defined in the current phase. Please check the Project Information settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoSpaceBoundingElementsWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoSpaceBoundingElementsWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoSpaceBoundingElementsWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace